Simsoniteee/TestRepo/F2837x_timer_toggle_led/device/driverlib/inc/hw_xbar.h
//*****************************************************************************
//
// The following are defines for the bit fields in the XBARCLR3 register
//
//*****************************************************************************
#define XBAR_CLR3_ADCCEVT2        0x1U         // Input Flag Clear for ADCCEVT2
                                               // Signal
#define XBAR_CLR3_ADCCEVT3        0x2U         // Input Flag Clear for ADCCEVT3
                                               // Signal
#define XBAR_CLR3_ADCCEVT4        0x4U         // Input Flag Clear for ADCCEVT4
                                               // Signal
#define XBAR_CLR3_ADCDEVT1        0x8U         // Input Flag Clear for ADCDEVT1
                                               // Signal
#define XBAR_CLR3_ADCDEVT2        0x10U        // Input Flag Clear for ADCDEVT2
                                               // Signal
#define XBAR_CLR3_ADCDEVT3        0x20U        // Input Flag Clear for ADCDEVT3
                                               // Signal
#define XBAR_CLR3_ADCDEVT4        0x40U        // Input Flag Clear for ADCDEVT4
                                               // Signal
#define XBAR_CLR3_SD1FLT1_COMPL   0x80U        // Input Flag Clear for
                                               // SD1FLT1.COMPL Signal
#define XBAR_CLR3_SD1FLT1_COMPH   0x100U       // Input Flag Clear for
                                               // SD1FLT1.COMPH Signal
#define XBAR_CLR3_SD1FLT2_COMPL   0x200U       // Input Flag Clear for
                                               // SD1FLT2.COMPL Signal
#define XBAR_CLR3_SD1FLT2_COMPH   0x400U       // Input Flag Clear for
                                               // SD1FLT2.COMPH Signal
#define XBAR_CLR3_SD1FLT3_COMPL   0x800U       // Input Flag Clear for
                                               // SD1FLT3.COMPL Signal
#define XBAR_CLR3_SD1FLT3_COMPH   0x1000U      // Input Flag Clear for
                                               // SD1FLT3.COMPH Signal
#define XBAR_CLR3_SD1FLT4_COMPL   0x2000U      // Input Flag Clear for
                                               // SD1FLT4.COMPL Signal
#define XBAR_CLR3_SD1FLT4_COMPH   0x4000U      // Input Flag Clear for
                                               // SD1FLT4.COMPH Signal
#define XBAR_CLR3_SD2FLT1_COMPL   0x8000U      // Input Flag Clear for
                                               // SD2FLT1.COMPL Signal
#define XBAR_CLR3_SD2FLT1_COMPH   0x10000U     // Input Flag Clear for
                                               // SD2FLT1.COMPH Signal
#define XBAR_CLR3_SD2FLT2_COMPL   0x20000U     // Input Flag Clear for
                                               // SD2FLT2.COMPL Signal
#define XBAR_CLR3_SD2FLT2_COMPH   0x40000U     // Input Flag Clear for
                                               // SD2FLT2.COMPH Signal
#define XBAR_CLR3_SD2FLT3_COMPL   0x80000U     // Input Flag Clear for
                                               // SD2FLT3.COMPL Signal
#define XBAR_CLR3_SD2FLT3_COMPH   0x100000U    // Input Flag Clear for
                                               // SD2FLT3.COMPH Signal
#define XBAR_CLR3_SD2FLT4_COMPL   0x200000U    // Input Flag Clear for
                                               // SD2FLT4.COMPL Signal
#define XBAR_CLR3_SD2FLT4_COMPH   0x400000U    // Input Flag Clear for
                                               // SD2FLT4.COMPH Signal
#endif
